** Primary Key Syntax


In “JOIN Types” on [[file:ch06.xhtml#page_78][page 78]], you created primary keys on the schools_left and schools_right tables to try out JOIN types. In fact, these were surrogate keys: in both tables, you created columns called id to use as the key and used the keywords CONSTRAINT key_name PRIMARY KEY to declare them as primary keys. Let's work through several more primary key examples.

In [[file:ch07.xhtml#ch07list1][Listing 7-1]], we declare a primary key using the column constraint and table constraint methods on a table similar to the driver's license example mentioned earlier. Because we expect the driver's license IDs to always be unique, we'll use that column as a natural key.

#+begin_src sql :engine postgresql :dbuser org  :dbpassword 1618 :database analysis
-- Listing 7-1: Declaring a single-column natural key as primary key

-- As a column constraint
CREATE TABLE natural_key_example (
    license_id varchar(10) CONSTRAINT license_key PRIMARY KEY,
    first_name varchar(50),
    last_name varchar(50)
);

-- Drop the table before trying again
DROP TABLE natural_key_example;

-- As a table constraint
CREATE TABLE natural_key_example (
    license_id varchar(10),
    first_name varchar(50),
    last_name varchar(50),
    CONSTRAINT license_key PRIMARY KEY (license_id)
);
#+end_src

#+RESULTS:
| CREATE TABLE |
|--------------|
| DROP TABLE   |
| CREATE TABLE |

Listing 7-1: Declaring a single-column natural key as a primary key/

We first use the column constraint syntax to declare license_id as the primary key by adding the CONSTRAINT keyword ➊ followed by a name for the key and then the keywords PRIMARY KEY. An advantage of using this syntax is that it's easy to understand at a glance which column is designated as the primary key. Note that in the column constraint syntax you can omit the CONSTRAINT keyword and name for the key, and simply use PRIMARY KEY.

Next, we delete the table from the database by using the DROP TABLE command ➋ to prepare for the table constraint example.

To add the same primary key using the table constraint syntax, we declare the CONSTRAINT after listing the final column ➌ with the column we want to use as the key in parentheses. In this example, we end up with the same column for the primary key as we did with the column constraint syntax. However, you must use the table constraint syntax when you want to create a primary key using more than one column. In that case, you would list the columns in parentheses, separated by commas. We'll explore that in a moment.

First, let's look at how having a primary key protects you from ruining the integrity of your data. [[file:ch07.xhtml#ch07list2][Listing 7-2]] contains two INSERT statements:

#+begin_src sql :engine postgresql :dbuser org  :dbpassword 1618 :database analysis
-- Listing 7-2: Example of a primary key violation
INSERT INTO natural_key_example (license_id, first_name, last_name)
VALUES ('T229901', 'Lynn', 'Malero');

INSERT INTO natural_key_example (license_id, first_name, last_name)
VALUES ('T229901', 'Sam', 'Tracy');
#+end_src

#+RESULTS:
| INSERT 0 1 |
|------------|

When you execute the first INSERT statement on its own, the server loads a row into the natural_key_example table without any issue. When you attempt to execute the second, the server replies with an error:

ERROR: duplicate key value violates unique constraint "license_key"
DETAIL: Key (license_id)=(T229901) already exists.

Before adding the row, the server checked whether a license_id of T229901 was already present in the table. Because it was, and because a primary key by definition must be unique for each row, the server rejected the operation. The rules of the fictional DMV state that no two drivers can have the same license ID, so checking for and rejecting duplicate data is one way for the database to enforce that rule.

** Creating a Composite Primary Key


If we want to create a natural key but a single column in the table isn't sufficient for meeting the primary key requirements for uniqueness, we may be able to create a suitable key from a combination of columns, which is called a /composite primary key/.

As a hypothetical example, let's use a table that tracks student school attendance. The combination of a student ID column and a date column would give us unique data for each row, tracking whether or not the student was in school each day during a school year. To create a composite primary key from two or more columns, you must declare it using the table constraint syntax mentioned earlier. [[file:ch07.xhtml#ch07list3][Listing 7-3]] creates an example table for the student attendance scenario. The school database would record each student_id only once per school_day, creating a unique value for the row. A present column of data type boolean indicates whether the student was there on that day.

#+begin_src sql :engine postgresql :dbuser org  :dbpassword 1618 :database analysis
-- Listing 7-3: Declaring a composite primary key as a natural key
CREATE TABLE natural_key_composite_example (
    student_id varchar(10),
    school_day date,
    present boolean,
    CONSTRAINT student_key PRIMARY KEY (student_id, school_day)
);
#+end_src

#+RESULTS:
| CREATE TABLE |
|--------------|

/Listing 7-3: Declaring a composite primary key as a natural key/

The syntax in [[file:ch07.xhtml#ch07list3][Listing 7-3]] follows the same table constraint format for adding a primary key for one column, but we pass two (or more) columns as arguments rather than one. Again, we can simulate a key violation by attempting to insert a row where the combination of values in the two key columns---student_id and school_day---is not unique to the table. Run the code in [[file:ch07.xhtml#ch07list4][Listing 7-4]]:

#+begin_src sql :engine postgresql :dbuser org  :dbpassword 1618 :database analysis
-- Listing 7-4: Example of a composite primary key violation

INSERT INTO natural_key_composite_example (student_id, school_day, present)
VALUES(775, '1/22/2017', 'Y');

INSERT INTO natural_key_composite_example (student_id, school_day, present)
VALUES(775, '1/23/2017', 'Y');

INSERT INTO natural_key_composite_example (student_id, school_day, present)
VALUES(775, '1/23/2017', 'N');
#+end_src

#+RESULTS:
|   |

The first two INSERT statements execute fine because there's no duplication of values in the combination of key columns. But the third statement causes an error because the student_id and school_day values it contains match a combination that already exists in the table:

ERROR: duplicate key value violates unique constraint "student_key"
DETAIL: Key (student_id, school_day)=(775, 2017-01-23) already exists.

You can create composite keys with more than two columns. The specific database you're using imposes the limit to the number of columns you can use.

** Creating an Auto-Incrementing Surrogate Key


If a table you're creating has no columns suitable for a natural primary key, you may have a data integrity problem; in that case, it's best to reconsider how you're structuring the database. If you're inheriting data for analysis or feel strongly about using surrogate keys, you can create a column and fill it with unique values. Earlier, I mentioned that some developers use UUIDs for this; others rely on software to generate a unique code. For our purposes, an easy way to create a surrogate primary key is with an auto-incrementing integer using one of the serial data types discussed in [[file:ch03.xhtml#lev34][“Auto-Incrementing Integers”]] on [[file:ch03.xhtml#page_27][page 27]].

Recall the three serial types: smallserial, serial, and bigserial. They correspond to the integer types smallint, integer, and bigint in terms of the range of values they handle and the amount of disk storage they consume. For a primary key, it may be tempting to try to save disk space by using serial, which handles numbers as large as 2,147,483,647. But many a database developer has received a late-night call from a user frantic to know why their application is broken, only to discover that the database is trying to generate a number one greater than the data type's maximum. For this reason, with PostgreSQL, it's generally wise to use bigserial, which accepts numbers as high as 9.2 /quintillion/. You can set it and forget it, as shown in the first column defined in [[file:ch07.xhtml#ch07list5][Listing 7-5]]:
#+begin_src sql :engine postgresql :dbuser org  :dbpassword 1618 :database analysis
-- Listing 7-5: Declaring a bigserial column as a surrogate key

CREATE TABLE surrogate_key_example (
    order_number bigserial,
    product_name varchar(50),
    order_date date,
    CONSTRAINT order_key PRIMARY KEY (order_number)
);

INSERT INTO surrogate_key_example (product_name, order_date)
VALUES ('Beachball Polish', '2015-03-17'),
       ('Wrinkle De-Atomizer', '2017-05-22'),
       ('Flux Capacitor', '1985-10-26');

SELECT * FROM surrogate_key_example;
#+end_src

#+RESULTS:
| CREATE TABLE |                     |            |
|--------------+---------------------+------------|
|   INSERT 0 3 |                     |            |
| order_number | product_name        | order_date |
|            1 | Beachball Polish    | 2015-03-17 |
|            2 | Wrinkle De-Atomizer | 2017-05-22 |
|            3 | Flux Capacitor      | 1985-10-26 |

/Listing 7-5: Declaring a bigserial column as a surrogate key/

[[file:ch07.xhtml#ch07list5][Listing 7-5]] shows how to declare the bigserial ➊ data type for an order_number column and set the column as the primary key ➋. When you insert data into the table ➌, you can omit the order_number column. With order_number set to bigserial, the database will create a new value for that column on each insert. The new value will be one greater than the largest already created for the column.

Run SELECT * FROM surrogate_key_example; to see how the column fills in automatically:

order_number    product_name           order_date
------------    -------------------    ----------
           1    Beachball Polish       2015-03-17
           2    Wrinkle De-Atomizer    2017-05-22
           3    Flux Capacitor         1985-10-26

The database will add one to order_number each time a new row is inserted. But it won't fill any gaps in the sequence created after rows are deleted.

*** Foreign Keys


With the /foreign key/ constraint, SQL very helpfully provides a way to ensure data in related tables doesn't end up unrelated, or orphaned. A foreign key is one or more columns in a table that match the primary key of another table. But a foreign key also imposes a constraint: values entered must already exist in the primary key or other unique key of the table it references. If not, the value is rejected. This constraint ensures that we don't end up with rows in one table that have no relation to rows in the other tables we can join them to.

To illustrate, [[file:ch07.xhtml#ch07list6][Listing 7-6]] shows two tables from a hypothetical database tracking motor vehicle activity:

#+begin_src sql :engine postgresql :dbuser org  :dbpassword 1618 :database analysis
-- Listing 7-6: A foreign key example

CREATE TABLE licenses (
    license_id varchar(10),
    first_name varchar(50),
    last_name varchar(50),
    CONSTRAINT licenses_key PRIMARY KEY (license_id)
);

CREATE TABLE registrations (
    registration_id varchar(10),
    registration_date date,
    license_id varchar(10) REFERENCES licenses (license_id),
    CONSTRAINT registration_key PRIMARY KEY (registration_id, license_id)
);

INSERT INTO licenses (license_id, first_name, last_name)
VALUES ('T229901', 'Lynn', 'Malero');

INSERT INTO registrations (registration_id, registration_date, license_id)
VALUES ('A203391', '3/17/2017', 'T229901');

INSERT INTO registrations (registration_id, registration_date, license_id)
VALUES ('A75772', '3/17/2017', 'T000001');
#+end_src

#+RESULTS:
| CREATE TABLE |
|--------------|
| CREATE TABLE |
| INSERT 0 1   |

The first table, licenses, is similar to the natural_key_example table we made earlier and uses a driver's unique license_id ➊ as a natural primary key. The second table, registrations, is for tracking vehicle registrations. A single license ID might be connected to multiple vehicle registrations, because each licensed driver can register multiple vehicles over a number of years. Also, a single vehicle could be registered to multiple license holders, establishing, as you learned in [[file:ch06.xhtml#ch06][Chapter 6]], a many-to-many relationship.

Here's how that relationship is expressed via SQL: in the registrations table, we designate the column license_id as a foreign key by adding the REFERENCES keyword, followed by the table name and column for it to reference ➋.

Now, when we insert a row into registrations, the database will test whether the value inserted into license_id already exists in the license_id primary key column of the licenses table. If it doesn't, the database returns an error, which is important. If any rows in registrations didn't correspond to a row in licenses, we'd have no way to write a query to find the person who registered the vehicle.

To see this constraint in action, create the two tables and execute the INSERT statements one at a time. The first adds a row to licenses ➌ that includes the value T229901 for the license_id. The second adds a row to registrations ➍ where the foreign key contains the same value. So far, so good, because the value exists in both tables. But we encounter an error with the third insert, which tries to add a row to registrations ➎ with a value for license_id that's not in licenses:

ERROR: insert or update on table "registrations" violates foreign key
constraint "registrations_license_id_fkey"
DETAIL: Key (license_id)=(T000001) is not present in table "licenses".

The resulting error is good because it shows the database is keeping the data clean. But it also indicates a few practical implications: first, it affects the order we insert data. We cannot add data to a table that contains a foreign key before the other table referenced by the key has the related records, or we'll get an error. In this example, we'd have to create a driver's license record before inserting a related registration record (if you think about it, that's what your local department of motor vehicles probably does).

Second, the reverse applies when we delete data. To maintain referential integrity, the foreign key constraint prevents us from deleting a row from licenses before removing any related rows in registrations, because doing so would leave an orphaned record. We would have to delete the related row in registrations first, and then delete the row in licenses. However, ANSI SQL provides a way to handle this order of operations automatically using the ON DELETE CASCADE keywords, which I'll discuss next.

*** The CHECK Constraint


A CHECK constraint evaluates whether data added to a column meets the expected criteria, which we specify with a logical test. If the criteria aren't met, the database returns an error. The CHECK constraint is extremely valuable because it can prevent columns from getting loaded with nonsensical data. For example, a new employee's birthdate probably shouldn't be more than 120 years in the past, so you can set a cap on birthdates. Or, in most schools I know, Z isn't a valid letter grade for a course (although my barely passing algebra grade felt like it), so we might insert constraints that only accept the values A--F.

As with primary keys, we can implement a CHECK constraint as a column constraint or a table constraint. For a column constraint, declare it in the CREATE TABLE statement after the column name and data type: CHECK (logical expression). As a table constraint, use the syntax CONSTRAINT constraint_name CHECK (logical expression) after all columns are defined.

[[file:ch07.xhtml#ch07list7][Listing 7-7]] shows a CHECK constraint applied to two columns in a table we might use to track the user role and salary of employees within an organization. It uses the table constraint syntax for the primary key and the CHECK constraint.

#+begin_src sql :engine postgresql :dbuser org  :dbpassword 1618 :database analysis
-- Listing 7-7: CHECK constraint examples

CREATE TABLE check_constraint_example (
    user_id bigserial,
    user_role varchar(50),
    salary integer,
    CONSTRAINT user_id_key PRIMARY KEY (user_id),
    CONSTRAINT check_role_in_list CHECK (user_role IN('Admin', 'Staff')),
    CONSTRAINT check_salary_not_zero CHECK (salary > 0)
);

-- Both of these will fail:
INSERT INTO check_constraint_example (user_role)
VALUES ('admin');

INSERT INTO check_constraint_example (salary)
VALUES (0);
#+end_src

#+RESULTS:
| CREATE TABLE |
|--------------|


We create the table and set the user_id column as an auto-incrementing surrogate primary key. The first CHECK ➊ tests whether values entered into the user_role column match one of two predefined strings, Admin or Staff, by using the SQL IN operator. The second CHECK tests whether values entered in the salary column are greater than 0, because no one should be earning a negative amount ➋. Both tests are another example of a /Boolean expression/, a statement that evaluates as either true or false. If a value tested by the constraint evaluates as true, the check passes.

*NOTE*

/Developers may debate whether check logic belongs in the database, in the application in front of the database, such as a human resources system, or both. One advantage of checks in the database is that the database will maintain data integrity in the case of changes to the application, even if a new system gets built or users are given alternate ways to add data./

When values are inserted or updated, the database checks them against the constraint. If the values in either column violate the constraint---or, for that matter, if the primary key constraint is violated---the database will reject the change.

If we use the table constraint syntax, we also can combine more than one test in a single CHECK statement. Say we have a table related to student achievement. We could add the following:

CONSTRAINT grad_check CHECK (credits >= 120 AND tuition = 'Paid')

Notice that we combine two logical tests by enclosing them in parentheses and connecting them with AND. Here, both Boolean expressions must evaluate as true for the entire check to pass. You can also test values across columns, as in the following example where we want to make sure an item's sale price is a discount on the original, assuming we have columns for both values:

CONSTRAINT sale_check CHECK (sale_price < retail_price)

Inside the parentheses, the logical expression checks that the sale price is less than the retail price.

